## DNS
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 2 to add, 0 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_route53_record.log4shell-tracker-alpha-canada-ca-A will be destroyed
  - resource "aws_route53_record" "log4shell-tracker-alpha-canada-ca-A" {
      - fqdn    = "log4shell.tracker.alpha.canada.ca" -> null
      - id      = "Z33C47YI9EN8XL_log4shell.tracker.alpha.canada.ca_A" -> null
      - name    = "log4shell.tracker.alpha.canada.ca" -> null
      - records = [
          - "34.95.5.243",
        ] -> null
      - ttl     = 300 -> null
      - type    = "A" -> null
      - zone_id = "Z33C47YI9EN8XL" -> null
    }

  # aws_route53_record.log4shell-tracker-alpha-canada-ca-NS will be created
  + resource "aws_route53_record" "log4shell-tracker-alpha-canada-ca-NS" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "log4shell.tracker.alpha.canada.ca"
      + records         = [
          + "ns1-log4shell.tracker.alpha.canada.ca",
        ]
      + ttl             = 300
      + type            = "NS"
      + zone_id         = "Z33C47YI9EN8XL"
    }

  # aws_route53_record.ns1-log4shell-tracker-alpha-canada-ca-A will be created
  + resource "aws_route53_record" "ns1-log4shell-tracker-alpha-canada-ca-A" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "ns1-log4shell.tracker.alpha.canada.ca"
      + records         = [
          + "34.95.5.243",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z33C47YI9EN8XL"
    }

Plan: 2 to add, 0 to change, 1 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.alpha-canada-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.cds-snc-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.notification-canada-ca-public"]

11 tests, 8 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
